#### Pandas

-Dataframe : Special object to data in tabular form row i.e. row and column

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\python37\lib\site-packages (1.2.0)
Requirement already satisfied: pytz>=2017.3 in c:\python37\lib\site-packages (from pandas) (2020.5)
Requirement already satisfied: numpy>=1.16.5 in c:\python37\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\python37\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\python37\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the 'c:\python37\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd
import numpy as np

In [4]:
#creating a dataframe
student={
    "marksA":np.random.randint(1,100,5),
    "marksB":np.random.randint(1,100,5),
    "marksC":np.random.randint(1,100,5),
}

In [5]:
student

{'marksA': array([82, 32, 13, 77, 18]),
 'marksB': array([61, 87, 42, 30, 40]),
 'marksC': array([ 9, 83, 37,  2, 24])}

In [16]:
df=pd.DataFrame(student)

In [8]:
df

   marksA  marksB  marksC
0      82      61       9
1      32      87      83
2      13      42      37
3      77      30       2
4      18      40      24

In [9]:
df.head()

   marksA  marksB  marksC
0      82      61       9
1      32      87      83
2      13      42      37
3      77      30       2
4      18      40      24

In [10]:
df.head(n=3)

   marksA  marksB  marksC
0      82      61       9
1      32      87      83
2      13      42      37

In [13]:
print(df.columns)

Index(['marksA', 'marksB', 'marksC'], dtype='object')

In [14]:
df=pd.DataFrame(student,dtype='float32')

In [15]:
df

   marksA  marksB  marksC
0    82.0    61.0     9.0
1    32.0    87.0    83.0
2    13.0    42.0    37.0
3    77.0    30.0     2.0
4    18.0    40.0    24.0

In [20]:
df.to_csv('marks.csv')

In [26]:
my_data=pd.read_csv('marks.csv')
my_data=my_data.drop(columns=['Unnamed: 0'])

In [27]:
my_data

   marksA  marksB  marksC
0      82      61       9
1      32      87      83
2      13      42      37
3      77      30       2
4      18      40      24

In [28]:
my_data.describe()

          marksA     marksB     marksC
count   5.000000   5.000000   5.000000
mean   44.400000  52.000000  31.000000
std    32.837479  22.549945  32.070235
min    13.000000  30.000000   2.000000
25%    18.000000  40.000000   9.000000
50%    32.000000  42.000000  24.000000
75%    77.000000  61.000000  37.000000
max    82.000000  87.000000  83.000000

In [29]:
my_data.count()

marksA    5
marksB    5
marksC    5
dtype: int64

In [30]:
my_data.mean()

marksA    44.4
marksB    52.0
marksC    31.0
dtype: float64

tail() method displays last n rows

In [33]:
my_data.tail(n=3)

   marksA  marksB  marksC
2      13      42      37
3      77      30       2
4      18      40      24

In [34]:
# Accessing row
df.iloc[3]  #iloc->integer location

marksA    77
marksB    30
marksC     2
Name: 3, dtype: int32

In [35]:
df.iloc[3][1]

30

In [37]:
idx=df.columns.get_loc('marksB')
df.iloc[2,idx]

42

In [41]:
idx=[df.columns.get_loc('marksA'),df.columns.get_loc('marksC')]
df.iloc[4,idx]

marksA    18
marksC    24
Name: 4, dtype: int32

In [42]:
df.iloc[:3,idx]

   marksA  marksC
0      82       9
1      32      83
2      13      37

In [45]:
df.iloc[:2,[0,2]]

   marksA  marksC
0      82       9
1      32      83

In [46]:
## Sort data in dataframe
my_data.sort_values(by=["marksB"])

   marksA  marksB  marksC
3      77      30       2
4      18      40      24
2      13      42      37
0      82      61       9
1      32      87      83

In [48]:
my_data.sort_values(by=["marksB","marksA"],ascending=False)

   marksA  marksB  marksC
1      32      87      83
0      82      61       9
2      13      42      37
4      18      40      24
3      77      30       2

In [49]:
data_array=my_data.values

In [50]:
data_array

array([[82, 61,  9],
       [32, 87, 83],
       [13, 42, 37],
       [77, 30,  2],
       [18, 40, 24]], dtype=int64)

In [51]:
print(type(my_data))

<class 'pandas.core.frame.DataFrame'>

In [52]:
print(type(data_array))

<class 'numpy.ndarray'>

In [53]:
print(my_data.shape)
print(data_array.shape)

(5, 3)
(5, 3)

In [54]:
data_array[2][1]

42

In [58]:
# numpy array back to datafram

In [56]:
new_df=pd.DataFrame(data_array,dtype='int32',columns=['Physics','Chemistry','Maths'])

In [57]:
new_df

   Physics  Chemistry  Maths
0       82         61      9
1       32         87     83
2       13         42     37
3       77         30      2
4       18         40     24

In [62]:
new_df.to_csv('PCM.csv',index=False) #index=False slice first column

In [64]:
pcm=pd.read_csv('PCM.csv')

In [65]:
pcm

   Physics  Chemistry  Maths
0       82         61      9
1       32         87     83
2       13         42     37
3       77         30      2
4       18         40     24